sorosaulong-ux/gd32-test-project/Library/gd32a7xx_i2c.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x003CU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the status of interrupt enable bit */
        ret1 = (I2C_REG_VAL(i2c_periph, int_flag) & BIT(I2C_BIT_POS(int_flag)));
        /* get the status of interrupt flag */
        ret2 = (I2C_REG_VAL2(i2c_periph, int_flag) & BIT(I2C_BIT_POS2(int_flag)));
        
        if((0U != ret1) && (0U != ret2)) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      clear I2C interrupt flag status (API_ID: 0x003DU)
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  int_flag: I2C interrupt flags, refer to i2c_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        I2C_INT_FLAG_ADDSEND: address received matches in slave mode interrupt flag
      \arg        I2C_INT_FLAG_NACK: not acknowledge interrupt flag
      \arg        I2C_INT_FLAG_STPDET: stop condition detected in slave mode interrupt flag
      \arg        I2C_INT_FLAG_BERR: bus error interrupt flag
      \arg        I2C_INT_FLAG_LOSTARB: arbitration lost interrupt flag
      \arg        I2C_INT_FLAG_OUERR: overrun/underrun error in slave mode interrupt flag
      \arg        I2C_INT_FLAG_PECERR: PEC error interrupt flag
      \arg        I2C_INT_FLAG_TIMEOUT: timeout interrupt flag
      \arg        I2C_INT_FLAG_SMBALT: SMBus Alert interrupt flag
    \param[out] none
    \retval     none
*/
void i2c_interrupt_flag_clear(uint32_t i2c_periph, i2c_interrupt_flag_enum int_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_I2C_PERIPH(i2c_periph)) {
        fw_debug_report_err(I2C_MODULE_ID, API_ID(0x003DU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        I2C_STATC(i2c_periph) |= BIT(I2C_BIT_POS2(int_flag));
    }
}
